src/test/resources/mockdata/vouchers/vouchers.json

{
  "vouchers": [
    {
      "id": "a9b99f8a-7100-47f2-9903-6293d44a9905",
      "systemCurrency": "USD",
      "invoiceCurrency": "EUR",
      "exchangeRate": 1.12,
      "exportToAccounting": false,
      "type": "Payment",
      "status": "Awaiting payment",
      "amount": 23.45,
      "voucherDate": "2019-05-06T00:00:00.000+0000",
      "voucherNumber": "1000",
      "invoiceId": "c0d08448-347b-418a-8c2f-5fb50248d67e",
      "accountingCode": "0206",
      "disbursementNumber": "EFT546789",
      "disbursementDate": "2019-05-05T00:00:00.000+0000",
      "disbursementAmount": 5,
      "batchGroupId": "e91d44e4-ae4f-401a-b355-3ea44f57a628",
      "vendorId": "e91d44e4-ae4f-401a-b355-3ea44f57a622",
      "metadata": {
        "createdDate": "2019-05-06T00:00:00.000+0000",
        "createdByUserId": "28d1057c-d137-11e8-a8d5-f2801f1b9fd1"
      }
    },
    {
      "id": "f914903e-0419-4123-9afc-73e863d1768c",
      "systemCurrency": "USD",
      "invoiceCurrency": "RUB",
      "exchangeRate": 1.12,
      "exportToAccounting": false,
      "type": "Payment",
      "status": "Awaiting payment",
      "amount": 23.45,
      "voucherDate": "2019-05-06T00:00:00.000+0000",
      "voucherNumber": "1001",
      "invoiceId": "402d0d32-7377-46a7-86ab-542b5684506e",
      "accountingCode": "0206",
      "disbursementNumber": "EFT546789",
      "disbursementDate": "2019-05-05T00:00:00.000+0000",
      "disbursementAmount": 5,
      "batchGroupId": "2a2cb998-1437-41d1-88ad-01930aaeadd5",
      "vendorId": "e91d44e4-ae4f-401a-b355-3ea44f57a622",
      "metadata": {
        "createdDate": "2019-05-06T00:00:00.000+0000",
        "createdByUserId": "28d1057c-d137-11e8-a8d5-f2801f1b9fd1"
      }
    }
  ],
  "totalRecords": 1
}
